IdeaRS.Connections
CleatConnectionType Enumeration
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.CleatConnectionType"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum CleatConnectionType
Members
Member name | Value | Description
Welded | 0
Bolted | 1
WeldedToConnectedMember | 2
BoltedToConnectedMember | 3
BoltedNotConnected | 4
WeldedNotConnected | 5
NotConnected | 6
See Also
Reference
IdeaRS.Connections.Data Namespace